# IFC_DMIsFieldEmpty

## Description
Checks if the indicated field, from current IFC Data Mapping, is empty.

```pascal
FUNCTION IFC_DMIsFieldEmpty(
				inStrObjName   : STRING;
				inStrEntryName : STRING;
				inStrFieldName : STRING) : BOOLEAN;
```

```python

def vs.IFC_DMIsFieldEmpty(inStrObjName, inStrEntryName, inStrFieldName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inStrObjName|STRING||
|inStrEntryName|STRING||
|inStrFieldName|STRING||

## Version
Availability: from Vectorworks 2017
## Category
* IFC